diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <comment>Дипломная работа Володин А.А.</comment>
  <attributes>
    <name>ПериодДляУказанияМесяца</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоров</name>
    <comment>Дипломная работа Володин А.А.</comment>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>РеализацияТоваровУслуг</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьРеализацию(Команда)
    
    Объект.СписокДоговоров.Очистить();
    
    ДлительнаяОперация = ЗаполнитьНаСервере();
    
    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    ПараметрыОжидания.Интервал = 1;
    ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
    
    ОписаниеОЗавершении = Новый ОписаниеОповещения("ВыполнитьЗавершение", ЭтотОбъект);
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьНаСервере()

    ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументыРеализаций", Объект.ПериодДляУказанияМесяца);
    
    Возврат ДлительнаяОперация;
    
КонецФункции

&НаКлиенте
Процедура ВыполнитьЗавершение(Результат, ДополнительныеПараметры) Экспорт

    Если Результат = Неопределено Тогда
        
        Возврат;
    
    КонецЕсли;
    
    Если Результат.Статус = "Выполнено" Тогда
        
        Если ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
                   
            МассивРеализаций = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
        
            ЗаполнитьДоговоры(МассивРеализаций);
            
        Иначе
            
            ТекстСообщения = НСтр("ru = 'ОБРАБОТКА: Массовое создание актов не выполнено.
                                        |Не получен адрес временного хранилища.'");
        
            ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения));
            
        КонецЕсли;
    
    КонецЕсли;
       
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоговоры(МассивРеализаций)

    Объект.СписокДоговоров.Очистить();

    Для Каждого Документ Из МассивРеализаций Цикл
        
        НоваяСтрока = Объект.СписокДоговоров.Добавить();
        НоваяСтрока.Договор = Документ.Договор;
        НоваяСтрока.РеализацияТоваровУслуг = Документ.Реализация;
    
    КонецЦикла;

КонецПроцедуры

#КонецОбласти
